{
  "backend/main.mo": "Defines data types and in-memory stores for documents, model stats, gender/geo distributions, purchase intention, and cleaning logs, with APIs to add/reset data and retrieve logs.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short descriptions of many frontend files, summarizing their purpose and functionality.",
  "frontend/index.css": "Defines Tailwind base styles and theme variables for light and dark mode using OKLCH color values.",
  "frontend/index.html": "Basic HTML bootstrap file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, layout, theme provider, and mounts all main application pages.",
  "frontend/src/components/BrandEmotionChart.tsx": "Builds a Recharts stacked bar chart showing emotion distribution per brand using mock analysis and visualization state handling.",
  "frontend/src/components/CleaningLogPanel.tsx": "Displays the latest cleaning logs with status icons, expandable UI, and loading logic using useGetLatestCleaningLog.",
  "frontend/src/components/ConfusionMatrixChart.tsx": "Renders a validated, color‑scaled confusion matrix with emotion labels and empty-state handling.",
  "frontend/src/components/DatasetUploadStatus.tsx": "Displays dataset upload progress, success details, or error messages based on upload state.",
  "frontend/src/components/EmotionChart.tsx": "Generates a bar chart of emotion frequencies from analyzed documents with fallback empty states.",
  "frontend/src/components/EmotionDistributionChart.tsx": "Creates a pie-chart-based emotion distribution with a frequency table and empty-state handling.",
  "frontend/src/components/EnsembleComparisonChart.tsx": "Shows a radar comparison of ensemble model metrics, converting values to percentages and validating data.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link with an icon.",
  "frontend/src/components/GenderEmotionChart.tsx": "Displays a bar chart comparing male and female emotion distribution, handling loading, missing data, and visualization state.",
  "frontend/src/components/GeoEmotionMap.tsx": "Processes and filters geographic emotion data for Indonesian regions and renders a color‑intensity grid map with validation and loading states.",
  "frontend/src/components/Header.tsx": "Renders the main app header with navigation, theme toggle, and a responsive mobile menu.",
  "frontend/src/components/IntentionBrandCorrelation.tsx": "Shows a stacked bar chart of purchase intention levels per brand, with fallback when no data is available.",
  "frontend/src/components/IntentionDemographics.tsx": "Generates mock gender and location demographic breakdowns from intention data and displays them as bar charts.",
  "frontend/src/components/IntentionTrendChart.tsx": "Builds time‑series trend data grouped by intention level and plots it as multi‑line historical trend chart.",
  "frontend/src/components/MarketingMixRadarChart.tsx": "Displays an 8‑factor marketing mix radar chart with dataset validation and fallback UI for insufficient data.",
  "frontend/src/components/MarketingRadarChart.tsx": "Generates a marketing effectiveness radar chart from computed metrics with state handling for missing or incomplete datasets.",
  "frontend/src/components/ModelPerformanceChart.tsx": "Renders a bar chart comparing model precision, recall, and F1‑score, including percentage conversion and empty‑state handling.",
  "frontend/src/components/PsychoSocialHeatmap.tsx": "Builds a psycho‑social heatmap based on UTAUT2 constructs, validating matrix dimensions and handling missing data.",
  "frontend/src/components/PurchaseIntentionChart.tsx": "Shows a pie chart of purchase‑intention distribution using fetched data with a simple no‑data fallback.",
  "frontend/src/components/RecentAnalysis.tsx": "Lists the five most recent document analyses using mock emotion analysis with badges and brief content previews.",
  "frontend/src/components/TemporalEvolutionChart.tsx": "Renders a line chart showing grouped emotion counts over time periods derived from document content.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to Internet Identity, invalidating related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for managing Internet Identity login, stored identity loading, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, uploading, and batch-uploading documents and related analytics via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles, theme variables, dark mode values, and print-optimized styles for reports.",
  "frontend/src/lib/datasetIngestion.ts": "Implements CSV and JSON dataset parsing with header normalization, validation, and structured row extraction.",
  "frontend/src/lib/marketingMetrics.ts": "Computes marketing funnel metric scores from document text and aggregates averages across documents for radar chart usage.",
  "frontend/src/lib/marketingMixMetrics.ts": "Calculates 8P Marketing Mix factor scores using keyword heuristics and generates normalized scores for visualization.",
  "frontend/src/lib/mockData.ts": "Provides brand detection, mock emotion analysis, and sample Indonesian EV brand data for testing and UI demos.",
  "frontend/src/lib/psychoSocialMetrics.ts": "Scores UTAUT2 psycho‑social dimensions and classifies document emotions deterministically for heatmap outputs.",
  "frontend/src/lib/strategicReport.ts": "Generates strategic reports by analyzing emotions, brand mentions, psycho‑social scores, and marketing metrics to produce recommendations.",
  "frontend/src/lib/strategicReportLocale.ts": "Defines bilingual UI labels and templates for strategic reports, supporting English and Indonesian localization.",
  "frontend/src/lib/visualizationState.ts": "Provides helpers for determining visualization state, sanitizing numeric data, safe array access, and normalizing emotion labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context and renders the main App component.",
  "frontend/src/pages/AnalysisPage.tsx": "Implements the emotion analysis interface with document filtering, visualization components, and deletion handling.",
  "frontend/src/pages/Dashboard.tsx": "Handles text and file uploads, dataset ingestion, and displays high-level analysis widgets and recent results.",
  "frontend/src/pages/MetricsPage.tsx": "Shows model and ensemble performance metrics, confusion matrices, and tracks dataset/model changes for updates.",
  "frontend/src/pages/PurchaseIntentionPage.tsx": "Displays purchase intention analytics, stats, and related charts derived from processed documents.",
  "frontend/src/pages/SettingsPage.tsx": "Provides a settings UI for configuring transformer models, ensemble options, thresholds, and adaptation features, with save functionality via toast notifications.",
  "frontend/src/pages/StrategicRecommendationReportPage.tsx": "Generates and displays a strategic recommendation report based on uploaded documents, supporting locale switching, markdown export, printing, and empty/loading states.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Tracks project version, high-level goals, architectural notes, known issues, and implemented feature metadata for dashboard visualizations and strategic reporting."
}