{
  "backend/main.mo": "Defines actor with data types and stores for documents, analysis results, gender/geo distributions, intentions, and exposes log management and data-reset APIs.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides human-written summaries for various frontend files describing their roles in routing, pages, components, hooks, and styles.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH color variables for light/dark themes and base styling.",
  "frontend/index.html": "Minimal HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and layout with header, footer, and theme provider.",
  "frontend/src/components/BrandEmotionChart.tsx": "Computes and visualizes per-brand emotion distributions using mock analysis and Recharts with dataset-aware empty states.",
  "frontend/src/components/CleaningLogPanel.tsx": "Displays latest data-cleaning logs with status icons and expandable list, handling loading and empty states.",
  "frontend/src/components/ConfusionMatrixChart.tsx": "Validates and renders a confusion matrix heatmap with color scaling, handling missing or invalid dataset states.",
  "frontend/src/components/DatasetUploadStatus.tsx": "Shows dataset upload progress and states including parsing, validating, uploading, completion, and errors.",
  "frontend/src/components/EmotionChart.tsx": "Generates a bar chart of emotion frequencies from analyzed documents, with empty-state handling.",
  "frontend/src/components/EmotionDistributionChart.tsx": "Creates a pie chart and frequency table for emotion distribution, including dataset and insufficient-data fallbacks.",
  "frontend/src/components/EnsembleComparisonChart.tsx": "Renders a radar chart comparing three ensemble models across precision, recall, F1, and accuracy, converting metrics to validated percentages with a custom tooltip.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying attribution text with a link and heart icon.",
  "frontend/src/components/GenderEmotionChart.tsx": "Displays a bar chart of emotion distribution by gender, handling loading, missing data, and visualization state.",
  "frontend/src/components/GeoEmotionMap.tsx": "Generates a geographic emotion intensity heatmap by filtering valid Indonesian regions and validating matrix data.",
  "frontend/src/components/Header.tsx": "Provides a top navigation bar with theme toggle, responsive menu, and navigation links based on current route.",
  "frontend/src/components/IntentionBrandCorrelation.tsx": "Shows a stacked bar chart of purchase intention levels grouped by brand using aggregated document data.",
  "frontend/src/components/IntentionDemographics.tsx": "Renders gender and geographic stacked bar charts summarizing purchase intention segments derived from documents.",
  "frontend/src/components/IntentionTrendChart.tsx": "Fetches documents, computes intention trend time‑series per level, and renders a multi‑line historical trend chart with loading and empty states.",
  "frontend/src/components/MarketingMixRadarChart.tsx": "Computes 8P Marketing Mix scores and displays them in a radar chart with validation and fallback UI for missing or insufficient data.",
  "frontend/src/components/MarketingRadarChart.tsx": "Generates marketing funnel metric scores and visualizes them in a radar chart with state handling for no or insufficient data.",
  "frontend/src/components/ModelPerformanceChart.tsx": "Converts model precision, recall, and F1 metrics to percentages and renders a bar chart with a custom tooltip and empty‑state handling.",
  "frontend/src/components/PsychoSocialHeatmap.tsx": "Computes a psycho‑social score matrix across UTAUT2 dimensions and emotions and renders a heatmap with validation and visualization state checks.",
  "frontend/src/components/PurchaseIntentionChart.tsx": "Aggregates purchase intention levels into a distribution and displays them as a pie chart with loading and empty‑state handling.",
  "frontend/src/components/RecentAnalysis.tsx": "Displays the five most recent documents with mock emotion analysis badges and previews.",
  "frontend/src/components/TemporalEvolutionChart.tsx": "Groups documents into periods and visualizes emotion frequency changes over time using a multi-line chart.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, uploading, and processing documents using the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode, and print-specific layout rules.",
  "frontend/src/lib/datasetIngestion.ts": "Parses and validates CSV datasets, normalizes headers, extracts required fields, and derives optional intention metadata.",
  "frontend/src/lib/icReplicaErrors.ts": "Provides helpers to extract IC replica rejection details, detect canister-stopped errors, and map upload errors to user-friendly messages.",
  "frontend/src/lib/marketingMetrics.ts": "Computes 0-100 marketing funnel metric scores per document and averages them for radar‑chart use.",
  "frontend/src/lib/marketingMixMetrics.ts": "Scores documents across the 8P marketing mix factors using keyword heuristics for radar‑chart visualization.",
  "frontend/src/lib/mockData.ts": "Contains EV brand detection and a mock emotion analysis generator producing heuristic emotion scores.",
  "frontend/src/lib/psychoSocialMetrics.ts": "Classifies emotion categories and computes UTAUT2 psycho‑social scores for documents using deterministic keyword rules.",
  "frontend/src/lib/purchaseIntentionAggregation.ts": "Aggregates purchase‑intention levels, averages, brand distributions, and mock time‑trend data from document text.",
  "frontend/src/lib/purchaseIntentionDerivation.ts": "Provides deterministic utilities to compute purchase intention scores and levels from text, including hashing, keyword adjustments, and validation helpers.",
  "frontend/src/lib/reportPdfExport.ts": "Implements browser-based PDF export by triggering print dialog and managing document title, plus a helper to check export availability.",
  "frontend/src/lib/strategicReport.ts": "Generates strategic reports from document analyses, including emotion, psychosocial, marketing, and brand metrics, producing summaries and recommendations.",
  "frontend/src/lib/strategicReportLocale.ts": "Defines EN/ID UI labels and priority mappings, along with localized templates for strategic report text generation.",
  "frontend/src/lib/visualizationState.ts": "Provides utilities for visualization state, numeric sanitation, safe array/matrix access, and emotion label normalization.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider, rendering the main App component.",
  "frontend/src/pages/AnalysisPage.tsx": "Renders the emotion analysis dashboard with filtering, charts, document management, and dataset status indicators.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page for text and file uploads, dataset ingestion, and navigation to analysis with various emotion and marketing visualizations.",
  "frontend/src/pages/MetricsPage.tsx": "Metrics dashboard displaying model and ensemble confusion matrices, performance charts, and dataset change notifications with reset controls.",
  "frontend/src/pages/PurchaseIntentionPage.tsx": "Computes purchase intention stats from documents and displays intention charts, correlations, trends, and demographics.",
  "frontend/src/pages/SettingsPage.tsx": "Settings interface for toggling model options, ensemble defaults, thresholds, and adaptive features with save feedback.",
  "frontend/src/pages/StrategicRecommendationReportPage.tsx": "Generates strategic recommendation reports with localization, export options, and document-based report rendering.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, components, animations, and plugins for the frontend styling system.",
  "project_state.json": "Defines project state, goals, architectural notes, issues, and existing features for dashboard visualizations and strategic reporting. Includes heatmap, radar charts, upload pipeline requirements, localization, and known rendering/upload issues."
}