{
  "backend/main.mo": "Defines Motoko actor with many data types and stores for documents, model stats, gender/location distributions, cleaning logs, and functions for managing logs and resetting data.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files, components, test IDs, and confidence values.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend components, pages, hooks, and utilities for documentation or build planning.",
  "frontend/index.css": "Defines global Tailwind-based OKLCH color variables for light/dark themes and applies base styles to body and elements.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx and mounts it into the root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global theme provider, header/footer layout, and mounts all main pages.",
  "frontend/src/components/BrandEmotionChart.tsx": "Computes and displays per-brand emotion distributions using mock analysis, sanitized chart data, and visualization state handling.",
  "frontend/src/components/CleaningLogPanel.tsx": "Displays latest cleaning logs with status icons, expandable panel, and loading state handling.",
  "frontend/src/components/ConfusionMatrixChart.tsx": "Renders a validated confusion matrix heatmap with dynamic coloring, emotion labels, and empty states.",
  "frontend/src/components/EmotionChart.tsx": "Shows a static bar chart visualizing predefined emotion frequencies.",
  "frontend/src/components/EmotionDistributionChart.tsx": "Computes emotion distribution from documents and displays a pie chart with fallback states.",
  "frontend/src/components/EnsembleComparisonChart.tsx": "Visualizes precision, recall, F1, and accuracy for three ensemble models using a radar chart with tooltips.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link.",
  "frontend/src/components/GenderEmotionChart.tsx": "Displays gender-based emotion distribution using a bar chart with loading and empty states.",
  "frontend/src/components/GeoEmotionMap.tsx": "Filters and validates Indonesian location-based emotion data, then renders a geographic emotion intensity map with loading and error states.",
  "frontend/src/components/Header.tsx": "Defines the top navigation header with theme toggle, navigation buttons, and a mobile menu drawer.",
  "frontend/src/components/IntentionBrandCorrelation.tsx": "Displays a stacked bar chart showing purchase intention levels grouped by brand using fetched correlation data.",
  "frontend/src/components/IntentionDemographics.tsx": "Builds gender and regional demographic bar charts using derived purchase intention distributions.",
  "frontend/src/components/IntentionTrendChart.tsx": "Generates a multi-line time series chart showing historical purchase intention trends by level.",
  "frontend/src/components/MarketingRadarChart.tsx": "Computes marketing metrics from documents and visualizes them in a radar chart with dataset and validation handling.",
  "frontend/src/components/ModelPerformanceChart.tsx": "Renders a bar chart comparing model precision, recall, and F1-score, with percentage validation and an empty-state message when no dataset is active.",
  "frontend/src/components/PsychoSocialHeatmap.tsx": "Generates a psycho-social heatmap from document metrics with validation and fallback UI when data is missing or insufficient.",
  "frontend/src/components/PurchaseIntentionChart.tsx": "Displays a pie chart of purchase intention distribution using fetched data, showing an empty state when values are unavailable.",
  "frontend/src/components/RecentAnalysis.tsx": "Shows the five most recent analyzed documents with mock emotion results or a placeholder when no documents exist.",
  "frontend/src/components/TemporalEvolutionChart.tsx": "Builds a line chart showing emotional trends over grouped time periods using mock analysis results.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, uploading, and deleting documents, including triggering backend processing and invalidating caches.",
  "frontend/src/index.css": "Configures Tailwind CSS theme variables, base styles, dark mode settings, and print-specific styles.",
  "frontend/src/lib/marketingMetrics.ts": "Computes marketing funnel metrics from document text using keyword-based scoring and averaging across documents.",
  "frontend/src/lib/mockData.ts": "Provides mock brand detection and mock emotion analysis utilities for frontend simulations.",
  "frontend/src/lib/psychoSocialMetrics.ts": "Computes emotion categories and psycho-social dimension scores for documents based on deterministic keyword rules.",
  "frontend/src/lib/strategicReport.ts": "Generates strategic reports by analyzing emotions, brand mentions, psycho-social metrics, and marketing metrics from documents.",
  "frontend/src/lib/visualizationState.ts": "Provides utilities for determining visualization state and sanitizing numeric data, including safe array access and emotion label normalization.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers, then renders the root component.",
  "frontend/src/pages/AnalysisPage.tsx": "Implements the emotion analysis page with dataset filtering, document management, and multiple emotion-based visualizations.",
  "frontend/src/pages/Dashboard.tsx": "Provides the main dashboard for uploading text or files, triggering analysis, and previewing high-level emotion insights.",
  "frontend/src/pages/MetricsPage.tsx": "Displays model and ensemble performance metrics with confusion matrices, tracking dataset changes and model selection.",
  "frontend/src/pages/PurchaseIntentionPage.tsx": "Shows purchase intention analytics derived from documents, including stats and correlation visualizations.",
  "frontend/src/pages/SettingsPage.tsx": "React settings page allowing users to toggle transformer models, configure ensemble defaults, and adjust analysis parameters with save feedback.",
  "frontend/src/pages/StrategicRecommendationReportPage.tsx": "Page that loads documents, generates a strategic report, supports markdown export and printing, and displays report metadata and recommendations.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and container settings, with plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing visualization and reporting features, known rendering issues, and build requirements for dashboard and strategic report functionality."
}