{
  "backend/main.mo": "Defines data types and stores for emotion analysis, cleaning logs, documents, and provides functions to add/query logs and reset stored analysis data.",
  "feature_evidence.json": "Lists feature evidence entries mapping header‑related UI changes to affected files and components with metadata and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend source files describing their roles in routing, UI components, charts, styling, and mock data.",
  "frontend/index.css": "Defines global Tailwind and OKLCH color variables for light/dark themes and applies base styling for borders and layout.",
  "frontend/index.html": "HTML entry point that loads the React application via root div and main.tsx script.",
  "frontend/src/App.tsx": "Sets up the application layout and routing using TanStack Router with theme support and toast notifications.",
  "frontend/src/components/BrandEmotionChart.tsx": "Generates a stacked bar chart of emotion counts per brand using mock analysis, handling empty states and normalized emotion labels.",
  "frontend/src/components/CleaningLogPanel.tsx": "Displays the latest cleaning log with status icons, expandable panel behavior, and loading/empty states using React Query.",
  "frontend/src/components/ConfusionMatrixChart.tsx": "Renders a confusion matrix with value validation, color scaling, and emotion label translation, including empty-state handling.",
  "frontend/src/components/DatasetUploadStatus.tsx": "Displays dataset upload progress and state-specific messages, including parsing, validation, upload metrics, success, and error details.",
  "frontend/src/components/EmotionChart.tsx": "Computes and visualizes emotion frequency as a bar chart using mock analysis, with empty-state handling.",
  "frontend/src/components/EmotionDistributionChart.tsx": "Generates a pie chart and frequency table for emotion distribution derived from mock analysis, with dataset and data validation states.",
  "frontend/src/components/EnsembleComparisonChart.tsx": "Displays radar chart comparing three ensemble models’ precision, recall, F1, and accuracy after converting metrics to percentages.",
  "frontend/src/components/Footer.tsx": "Simple footer showing a copyright notice and link to caffeine.ai.",
  "frontend/src/components/GenderEmotionChart.tsx": "Renders a bar chart comparing emotional distribution between male and female users, with loading and empty‑state handling. Processes gender emotion data and sanitizes it before visualization.",
  "frontend/src/components/GeoEmotionMap.tsx": "Builds a geographic emotion heatmap by filtering Indonesian regions and validating matrix data. Includes loading, error states, and color‑intensity scaling.",
  "frontend/src/components/Header.tsx": "Provides the main app header with navigation links, theme toggle, and a mobile drawer menu. Highlights active routes using TanStack Router state.",
  "frontend/src/components/IntentionBrandCorrelation.tsx": "Displays a stacked bar chart showing purchase‑intention levels across brands, using aggregated document data. Handles loading and empty dataset conditions.",
  "frontend/src/components/IntentionDemographics.tsx": "Shows gender‑ and location‑based purchase‑intention segmentation using bar charts. Computes demographic breakdowns from document data and supports loading states.",
  "frontend/src/components/IntentionTrendChart.tsx": "Generates a time‑series line chart of purchase‑intention trends grouped by level. Builds synthetic time periods and handles loading or missing data.",
  "frontend/src/components/MarketingMixRadarChart.tsx": "Renders an 8-factor marketing mix radar chart with validation and empty-state handling based on computed scores from documents.",
  "frontend/src/components/MarketingRadarChart.tsx": "Displays a marketing funnel radar chart by computing and clamping metric scores, including localized empty-state messaging.",
  "frontend/src/components/ModelPerformanceChart.tsx": "Shows bar-chart comparisons of model precision, recall, and F1-score, converting metrics to validated percentages with a custom tooltip.",
  "frontend/src/components/PsychoSocialHeatmap.tsx": "Generates a psycho‑social heatmap using UTAUT2 constructs and emotion dimensions, validating matrix shape and handling insufficient data states.",
  "frontend/src/components/PurchaseIntentionChart.tsx": "Creates a pie chart of purchase intention levels using aggregated document distributions with loading and no‑data states.",
  "frontend/src/components/RecentAnalysis.tsx": "Lists recent documents with mock emotion analysis badges and confidence scores, showing an empty prompt when no data exists.",
  "frontend/src/components/TemporalEvolutionChart.tsx": "Renders a time‑grouped line chart of primary emotions derived from documents using mock analysis.",
  "frontend/src/hooks/useActor.ts": "Manages creation and lifecycle of an authenticated or anonymous backend actor using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, and identity management via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines document- and metrics-related React Query hooks for fetching, uploading, and processing data via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode, and print‑optimized report styling.",
  "frontend/src/lib/datasetIngestion.ts": "Parses and validates CSV dataset uploads, normalizing fields and generating or checking intention‑related values.",
  "frontend/src/lib/icReplicaErrors.ts": "Helpers to extract IC replica rejection details, detect canister-stopped errors, and map upload errors to user-friendly messages.",
  "frontend/src/lib/marketingMetrics.ts": "Computes 0–100 marketing funnel scores from document text and aggregates averages for radar charts.",
  "frontend/src/lib/marketingMixMetrics.ts": "Scores documents against 8 Marketing Mix factors using keyword heuristics for radar visualizations.",
  "frontend/src/lib/mockData.ts": "Provides brand detection and mock emotion analysis with randomized scores for testing.",
  "frontend/src/lib/psychoSocialMetrics.ts": "Classifies emotions and computes UTAUT2 psycho-social scores from text using deterministic rules.",
  "frontend/src/lib/purchaseIntentionAggregation.ts": "Aggregates purchase intention levels, averages, brand distributions, and mock trend data from documents.",
  "frontend/src/lib/purchaseIntentionDerivation.ts": "Provides deterministic text-based purchase‑intention scoring and level classification, plus validation helpers. Uses hashing and keyword heuristics to compute 0–100 scores and low/medium/high levels.",
  "frontend/src/lib/reportPdfExport.ts": "Implements client‑side PDF export via browser print dialog with filename handling. Includes availability checking for the report container.",
  "frontend/src/lib/strategicReport.ts": "Generates strategic reports using emotion, psychosocial, marketing, and brand‑mention analyses. Provides helper functions for summarizing datasets and deriving recommendations.",
  "frontend/src/lib/strategicReportLocale.ts": "Defines English/Indonesian UI labels and priority mappings for strategic reports. Provides localized template retrieval for report generation.",
  "frontend/src/lib/visualizationState.ts": "Utilities for determining visualization state and sanitizing numeric data. Includes helpers for safe array access, matrix validation, and emotion label normalization.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity provider. Renders the root application component.",
  "frontend/src/pages/AnalysisPage.tsx": "Implements the emotion analysis dashboard with filtering, charts, and document management. Supports brand/emotion filters, dataset status, and deletion actions.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page handling text and file uploads, dataset parsing, and navigation to analysis views.",
  "frontend/src/pages/MetricsPage.tsx": "Metrics page showing model and ensemble confusion matrices with dataset change tracking and reset controls.",
  "frontend/src/pages/PurchaseIntentionPage.tsx": "Displays purchase‑intention metrics and charts computed from uploaded documents.",
  "frontend/src/pages/SettingsPage.tsx": "Settings UI for configuring model toggles, ensemble defaults, and analysis parameters.",
  "frontend/src/pages/StrategicRecommendationReportPage.tsx": "Generates and displays a strategic recommendation report with export, locale switching, and no‑data handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines project state, goals, architectural notes, known issues, and existing features for building dashboard visualizations, reports, and UI updates. Provides structured guidance for heatmaps, radar charts, upload pipelines, localization, and design requirements."
}