{
  "backend/main.mo": "Motoko canister defining document, emotion, gender, geography, intention, and cleaning log types with storage maps and CRUD-style methods for logs and model data.",
  "feature_evidence.json": "Feature evidence report mapping features to impacted frontend files, components, and test IDs for error-handling improvements around IC replica rejection.",
  "frontend-file-summaries.txt": "Plain-text mapping of frontend file paths to short functional descriptions of each component and page.",
  "frontend/index.css": "Tailwind base/theme variables defining OKLCH color tokens, dark mode overrides, and global background/foreground styling.",
  "frontend/index.html": "Base HTML file loading the React root container and main entry script.",
  "frontend/src/App.tsx": "Application root configuring TanStack Router routes, layout with header/footer, theme provider, and toaster notifications.",
  "frontend/src/components/BrandEmotionChart.tsx": "Recharts bar chart aggregating per-brand emotion counts from mock analysis with dataset-aware empty states and sanitized chart data.",
  "frontend/src/components/CleaningLogPanel.tsx": "Displays latest cleaning logs with expandable UI, status icons, and color-coded badges based on log status. Fetches data and shows loading, empty, and detailed log states.",
  "frontend/src/components/ConfusionMatrixChart.tsx": "Renders a confusion matrix with validation, dynamic color gradients, and adaptive text styling. Handles missing data and model-specific palettes for visualization.",
  "frontend/src/components/DatasetUploadStatus.tsx": "Shows progress and status messages for dataset parsing, validation, and upload stages. Displays success, error, and detailed row statistics when applicable.",
  "frontend/src/components/EmotionChart.tsx": "Generates a bar chart of emotion counts derived from document analyses. Includes empty-state handling and normalized emotion labeling.",
  "frontend/src/components/EmotionDistributionChart.tsx": "Builds a pie chart and frequency table of emotion distribution using canonical ordering. Handles dataset validation and aggregates emotion totals from documents.",
  "frontend/src/components/EnsembleComparisonChart.tsx": "Radar chart comparing three ensemble models (JC, JA, JD) across precision, recall, F1, and accuracy with percentage conversion and custom tooltip.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying © 2025 attribution with a link to caffeine.ai.",
  "frontend/src/components/GenderEmotionChart.tsx": "Bar chart showing emotion distribution by derived gender using aggregated emotion analysis with fallback visualization states.",
  "frontend/src/components/GeoEmotionMap.tsx": "Geographic emotion heatmap filtering Indonesian regions, validating matrices, and scaling color intensity based on emotion counts.",
  "frontend/src/components/Header.tsx": "Top navigation bar with route-based active states, theme toggle, and mobile sheet menu.",
  "frontend/src/components/IntentionBrandCorrelation.tsx": "Stacked bar chart displaying purchase intention levels (high, medium, low) aggregated per brand.",
  "frontend/src/components/IntentionDemographics.tsx": "Renders gender and location-based purchase intention bar charts using aggregated document data with loading and empty states.",
  "frontend/src/components/IntentionTrendChart.tsx": "Builds a time-series line chart showing purchase intention trends per level using computed trend data from documents.",
  "frontend/src/components/MarketingMixRadarChart.tsx": "Generates an 8-factor marketing mix radar chart with validation and fallback states based on computed scores.",
  "frontend/src/components/MarketingRadarChart.tsx": "Displays a marketing effectiveness radar chart derived from computed funnel metrics with validation handling.",
  "frontend/src/components/ModelPerformanceChart.tsx": "Shows a bar chart comparing model precision, recall, and F1-score, converting metrics to percentages with tooltips and empty states.",
  "frontend/src/components/PsychoSocialHeatmap.tsx": "Computes and visualizes a psycho-social heatmap matrix across UTAUT2 dimensions and emotions with validation and fallback states.",
  "frontend/src/components/PurchaseIntentionChart.tsx": "Renders a pie chart showing purchase intention distribution using fetched documents and computed levels.",
  "frontend/src/components/RecentAnalysis.tsx": "Displays the five most recent analyzed documents with mock emotion results and confidence badges.",
  "frontend/src/components/TemporalEvolutionChart.tsx": "Builds a line chart tracking emotion frequencies over grouped time periods derived from documents.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and triggers query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines queries and mutations for fetching documents, uploading content, and triggering related backend processes.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables including chart and confusion‑matrix color palettes for light and dark modes.",
  "frontend/src/lib/confusionMatrixPalettes.ts": "Defines model-specific confusion‑matrix color palettes, normalizes model names, and provides legend swatch generation.",
  "frontend/src/lib/csvRfc4180.ts": "Implements an RFC4180‑compliant CSV parser handling quotes, escapes, and newlines, plus utilities for stats and field trimming.",
  "frontend/src/lib/datasetIngestion.ts": "Provides CSV/JSON dataset ingestion with header normalization, text‑field recovery, validation, and intention‑field handling.",
  "frontend/src/lib/icReplicaErrors.ts": "Extracts Internet Computer replica rejection details and maps them to user‑friendly and technical error messages.",
  "frontend/src/lib/marketingMetrics.ts": "Computes normalized marketing‑funnel metric scores from document text and aggregates them across documents.",
  "frontend/src/lib/marketingMixMetrics.ts": "Computes normalized 8P Marketing Mix factor scores from document text based on keyword heuristics.",
  "frontend/src/lib/mockData.ts": "Provides mock EV brand detection and simulated emotion analysis with heuristic keyword scoring.",
  "frontend/src/lib/psychoSocialMetrics.ts": "Computes deterministic emotion categories and UTAUT2 psycho‑social scores from document text.",
  "frontend/src/lib/purchaseIntentionAggregation.ts": "Aggregates purchase‑intention scores and levels across documents, including brand‑level and trend summaries.",
  "frontend/src/lib/purchaseIntentionDerivation.ts": "Derives deterministic purchase‑intention scores and levels from text using hashing and keyword adjustments.",
  "frontend/src/lib/reportPdfExport.ts": "Handles client‑side PDF exporting via browser print dialog with optional filename settings.",
  "frontend/src/lib/strategicReport.ts": "Generates strategic reports by analyzing emotions, psycho‑social dimensions, marketing metrics, and brand mentions.",
  "frontend/src/lib/strategicReportLocale.ts": "Defines bilingual UI labels and templates for strategic report localization in English and Indonesian.",
  "frontend/src/lib/visualizationState.ts": "Provides utilities for determining visualization state, sanitizing numeric data, safe array access, emotion label normalization, and related helpers.",
  "frontend/src/main.tsx": "Bootstraps the React application with React Query and Internet Identity providers.",
  "frontend/src/pages/AnalysisPage.tsx": "Displays emotion analysis with filtering, search, visualizations, and document deletion.",
  "frontend/src/pages/Dashboard.tsx": "Handles document uploads, text analysis, dataset ingestion, and shows overview charts and recent analysis.",
  "frontend/src/pages/MetricsPage.tsx": "Shows model performance metrics, confusion matrices, and dataset reset logic with model switching.",
  "frontend/src/pages/PurchaseIntentionPage.tsx": "Computes and visualizes purchase intention statistics and related demographic and trend charts.",
  "frontend/src/pages/SettingsPage.tsx": "A settings UI allowing users to configure model toggles, ensemble defaults, thresholds, and adaptive options, with save notification support.",
  "frontend/src/pages/StrategicRecommendationReportPage.tsx": "Generates and displays a strategic report from documents with locale switching and options to copy, print, or export the report.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, components, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata tracking versions, known upload issues, and feature requirements related to IC0508 canister-stopped error handling."
}