{
  "backend/main.mo": "Defines data models and stores for documents, emotion metrics, gender/location distributions, purchase intention, logs, and exposes CRUD/reset query and update methods.",
  "feature_evidence.json": "Describes feature evidence entries mapping high‑level product requirements to specific frontend source files and components.",
  "frontend-file-summaries.txt": "Provides short descriptive summaries for multiple frontend source files to support build or documentation workflows.",
  "frontend/index.css": "Defines global Tailwind and OKLCH color variables plus base and dark‑mode theme styles for the app.",
  "frontend/index.html": "Minimal HTML entrypoint mounting the React application with a root div and main module script.",
  "frontend/src/App.tsx": "Sets up the main app layout and routing using TanStack Router, wrapping pages with theme and toaster providers.",
  "frontend/src/components/BrandEmotionChart.tsx": "Aggregates brand‑emotion counts from documents and renders a sanitized bar chart with dataset‑aware empty states.",
  "frontend/src/components/CleaningLogPanel.tsx": "Displays latest cleaning logs with status icons, expandable UI, and loading state using fetched data.",
  "frontend/src/components/ConfusionMatrixChart.tsx": "Renders a validated confusion matrix heatmap with color scaling, emotion translation, and empty-state handling.",
  "frontend/src/components/EmotionChart.tsx": "Builds a bar chart of emotion frequencies from analyzed documents with state checks and mock emotion extraction.",
  "frontend/src/components/EmotionDistributionChart.tsx": "Generates a pie chart and frequency table of emotion distribution with validation and mock analysis.",
  "frontend/src/components/EnsembleComparisonChart.tsx": "Visualizes ensemble model metrics in a radar chart with percentage conversion, tooltips, and dataset validation.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying a copyright note and link to caffeine.ai.",
  "frontend/src/components/GenderEmotionChart.tsx": "Renders a bar chart comparing male and female emotion counts with loading and error states based on gender distribution data.",
  "frontend/src/components/GeoEmotionMap.tsx": "Processes and filters geographic emotion data for valid Indonesian regions and displays a color‑intensity map with loading and fallback states.",
  "frontend/src/components/Header.tsx": "Implements the main app header with navigation, theme toggle, and responsive mobile menu.",
  "frontend/src/components/IntentionBrandCorrelation.tsx": "Displays a stacked bar chart showing high, medium, and low purchase‑intention levels per brand using fetched intention data.",
  "frontend/src/components/IntentionDemographics.tsx": "Generates mock gender and location segmentation from intention data and visualizes both in bar charts with fallback when data is missing.",
  "frontend/src/components/IntentionTrendChart.tsx": "Builds a time‑series line chart showing historical purchase‑intention trends grouped by intention level.",
  "frontend/src/components/MarketingMixRadarChart.tsx": "Displays an 8-factor Marketing Mix radar chart, computing scores from documents and handling empty or invalid dataset states.",
  "frontend/src/components/MarketingRadarChart.tsx": "Renders a marketing effectiveness radar chart by computing funnel metrics and showing fallback UI when data is missing.",
  "frontend/src/components/ModelPerformanceChart.tsx": "Shows bar charts comparing model precision, recall, and F1-score after converting metrics to percentages, with an empty-state view if no dataset is active.",
  "frontend/src/components/PsychoSocialHeatmap.tsx": "Generates a psycho‑social heatmap using UTAUT2 constructs and emotion scores, validating matrix dimensions and handling insufficient data.",
  "frontend/src/components/PurchaseIntentionChart.tsx": "Displays a pie chart of purchase intention levels from fetched data, with a simple placeholder when no values are available.",
  "frontend/src/components/RecentAnalysis.tsx": "Lists the most recent analyzed documents with mock emotion tags and confidence scores, or shows a placeholder when no documents exist.",
  "frontend/src/components/TemporalEvolutionChart.tsx": "Renders a temporal emotion trend line chart by grouping documents into time periods and plotting emotion counts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations and analytics calls on documents using the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, dark mode themes, and print-optimized styling for reports.",
  "frontend/src/lib/marketingMetrics.ts": "Computes marketing funnel metric scores from document text and aggregates them across documents.",
  "frontend/src/lib/marketingMixMetrics.ts": "Computes deterministic Marketing Mix (8P) factor scores from document text using keyword-based scoring.",
  "frontend/src/lib/mockData.ts": "Provides mock brand detection and emotion analysis utilities using simple keyword heuristics and random scoring.",
  "frontend/src/lib/psychoSocialMetrics.ts": "Implements deterministic emotion classification and UTAUT2 psycho‑social scoring for heatmap metrics.",
  "frontend/src/lib/strategicReport.ts": "Generates strategic reports by analyzing emotions, brand mentions, psycho-social scores, and marketing metrics.",
  "frontend/src/lib/strategicReportLocale.ts": "Defines bilingual UI labels and content templates for strategic reports in English and Indonesian.",
  "frontend/src/lib/visualizationState.ts": "Utility helpers for determining visualization state, sanitizing numeric data, and safe array/matrix access.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, and Internet Identity provider before rendering the main component.",
  "frontend/src/pages/AnalysisPage.tsx": "Provides an emotion analysis interface with document filtering, deletion, charts, and dataset status indicators.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard for uploading text or files, triggering analysis, and showing overview charts and navigation actions.",
  "frontend/src/pages/MetricsPage.tsx": "Displays model and ensemble performance metrics with confusion matrices, tabs, and dataset change detection.",
  "frontend/src/pages/PurchaseIntentionPage.tsx": "Shows purchase intention analytics with statistics and charts derived from model output and document data.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI controls for configuring model selection, ensemble settings, thresholds, and adaptive features.",
  "frontend/src/pages/StrategicRecommendationReportPage.tsx": "React page that loads documents, generates a localized strategic report, and provides UI for copying, printing, and viewing the report with empty-state handling.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending theme colors, animations, and containers, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state file describing current features, requirements, architecture notes, and known issues for dashboard visualizations and strategic reporting."
}