{
  "backend/main.mo": "Motoko canister defining data types and storing documents, model stats, distributions, and cleaning logs with reset and retrieval APIs.",
  "feature_evidence.json": "Feature evidence list mapping feature IDs to involved frontend files, components, and test IDs for language toggle and report localization.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend pages, components, charts, and hooks for navigation, analysis, metrics, and visualization.",
  "frontend/index.css": "Tailwind CSS base with OKLCH variables defining light and dark theme color tokens and global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, layout with header/footer, and theme provider.",
  "frontend/src/components/BrandEmotionChart.tsx": "React chart component aggregating and displaying emotion distribution per brand with empty-state handling and sanitized data.",
  "frontend/src/components/CleaningLogPanel.tsx": "Displays expandable cleaning log entries with status icons and colors based on the latest preprocessing logs.",
  "frontend/src/components/ConfusionMatrixChart.tsx": "Renders a confusion matrix with validation, color scaling, and emotion label translation, showing empty states when data is invalid.",
  "frontend/src/components/EmotionChart.tsx": "Shows a static bar chart of emotion distribution using Recharts.",
  "frontend/src/components/EmotionDistributionChart.tsx": "Generates a pie chart and frequency table of emotion counts from documents, with dataset validation and empty-state handling.",
  "frontend/src/components/EnsembleComparisonChart.tsx": "Visualizes ensemble model metrics in a radar chart, converting values to percentages and providing a custom tooltip.",
  "frontend/src/components/Footer.tsx": "Simple footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/GenderEmotionChart.tsx": "Displays gender-based emotion distribution in a bar chart with loading and empty-state support.",
  "frontend/src/components/GeoEmotionMap.tsx": "Displays a filtered geographic heatmap of emotions across valid Indonesian regions using intensity-based coloring and validation logic.",
  "frontend/src/components/Header.tsx": "Provides the main navigation header with theme toggle, routing buttons, and a responsive mobile menu.",
  "frontend/src/components/IntentionBrandCorrelation.tsx": "Shows a stacked bar chart of purchase intention levels (high/medium/low) per brand using fetched correlation data.",
  "frontend/src/components/IntentionDemographics.tsx": "Renders gender and regional demographic bar charts derived from purchase intention distribution values.",
  "frontend/src/components/IntentionTrendChart.tsx": "Builds a multi-line time‑series chart visualizing historical purchase intention trends grouped by intention level.",
  "frontend/src/components/MarketingRadarChart.tsx": "Generates a radar chart of marketing funnel metrics from document data with validation and fallback states.",
  "frontend/src/components/ModelPerformanceChart.tsx": "Renders a bar chart comparing model precision, recall, and F1‑score with percentage conversion and empty‑state handling.",
  "frontend/src/components/PsychoSocialHeatmap.tsx": "Computes and displays a psycho‑social heatmap from documents, validating matrix dimensions and showing fallback states when data is insufficient.",
  "frontend/src/components/PurchaseIntentionChart.tsx": "Displays a pie chart of purchase‑intention distribution using query data, with a simple no‑data fallback.",
  "frontend/src/components/RecentAnalysis.tsx": "Shows the five most recent documents with mock emotion analysis and badges for emotion and confidence.",
  "frontend/src/components/TemporalEvolutionChart.tsx": "Generates a line chart of emotion frequency over grouped time periods based on mock analysis.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity loading, state tracking, and integration with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching, uploading, deleting, and analyzing documents via an actor, with query invalidation and preprocessing steps.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and print-optimized report styling.",
  "frontend/src/lib/marketingMetrics.ts": "Computes marketing funnel metric scores from document text and aggregates them across documents.",
  "frontend/src/lib/mockData.ts": "Provides brand detection and mock emotion analysis utilities using simple keyword heuristics.",
  "frontend/src/lib/psychoSocialMetrics.ts": "Classifies emotion categories and computes psycho-social dimension scores for documents via keyword scoring.",
  "frontend/src/lib/strategicReport.ts": "Generates strategic report data by analyzing emotions, brands, psycho-social metrics, and marketing metrics from documents.",
  "frontend/src/lib/strategicReportLocale.ts": "Defines bilingual UI labels and helpers for strategic report localization and priority labels.",
  "frontend/src/lib/visualizationState.ts": "Provides utilities for determining visualization state and sanitizing numeric or matrix-based chart data.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity context providers.",
  "frontend/src/pages/AnalysisPage.tsx": "Implements the emotion analysis page with document filtering, charts, and deletion handling.",
  "frontend/src/pages/Dashboard.tsx": "Provides the main dashboard for text/file upload, dataset status, and navigation to analysis and metrics.",
  "frontend/src/pages/MetricsPage.tsx": "Renders model and ensemble performance metrics, confusion matrices, and dataset change notifications.",
  "frontend/src/pages/PurchaseIntentionPage.tsx": "Renders a purchase intention dashboard with stats, charts, and loading states derived from intention data and uploaded documents.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI controls for configuring model selection, ensemble algorithm, thresholds, and saving settings.",
  "frontend/src/pages/StrategicRecommendationReportPage.tsx": "Generates and displays a strategic recommendation report from uploaded documents with locale switching, export, and print options.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Describes the project state, known issues, and implemented features related to dashboard visualizations and strategic reporting."
}