{
  "backend/main.mo": "Motoko canister defining data models, storage maps, and functions for logs, documents, model statistics, and resets.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind-based global style definitions including light/dark theme variables and component color tokens.",
  "frontend/index.html": "HTML entry template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, layout, theme provider, and global toaster.",
  "frontend/src/components/BrandEmotionChart.tsx": "Chart component aggregating brand-linked emotion counts and rendering a stacked bar chart with empty-state handling.",
  "frontend/src/components/CleaningLogPanel.tsx": "Displays latest data-cleaning steps with status icons, expandable details, and loading states using fetched cleaning logs.",
  "frontend/src/components/ConfusionMatrixChart.tsx": "Validates and visualizes a confusion matrix with color‑scaled cells, emotion label translation, and empty‑state handling.",
  "frontend/src/components/DatasetUploadStatus.tsx": "Shows dataset upload progress, status messages, errors, and completion details with dynamic UI states.",
  "frontend/src/components/EmotionChart.tsx": "Generates a bar chart of emotion counts from documents, handling empty states and normalized emotion labels.",
  "frontend/src/components/EmotionDistributionChart.tsx": "Produces a pie chart and frequency table of emotion distribution from documents with validation and empty‑state logic.",
  "frontend/src/components/EnsembleComparisonChart.tsx": "Radar chart component comparing precision, recall, F1, and accuracy across three ensemble methods with custom tooltip and percentage formatting.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link with an icon.",
  "frontend/src/components/GenderEmotionChart.tsx": "Bar chart showing emotion distribution by gender with loading, empty-state handling, and sanitized chart data.",
  "frontend/src/components/GeoEmotionMap.tsx": "Geographical emotion heatmap filtering Indonesian regions, validating matrix data, and visualizing intensity levels.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, responsive menu, and route-based navigation buttons.",
  "frontend/src/components/IntentionBrandCorrelation.tsx": "Stacked bar chart visualizing purchase intention levels (high, medium, low) per brand with fallback for missing data.",
  "frontend/src/components/IntentionDemographics.tsx": "Demographic purchase-intention charts generating mock gender and location data and displaying them as bar charts.",
  "frontend/src/components/IntentionTrendChart.tsx": "Displays a line chart of historical purchase intention trends grouped by intention level using data from usePurchaseIntentionData.",
  "frontend/src/components/MarketingMixRadarChart.tsx": "Renders an 8‑factor Marketing Mix radar chart with validation and empty-state handling based on computed scores.",
  "frontend/src/components/MarketingRadarChart.tsx": "Shows a radar chart of marketing funnel metrics computed from documents with dataset-aware empty-state logic.",
  "frontend/src/components/ModelPerformanceChart.tsx": "Visualizes model precision, recall, and F1-score as a bar chart with percentage conversion and custom tooltip.",
  "frontend/src/components/PsychoSocialHeatmap.tsx": "Generates a heatmap of psycho-social metrics across UTAUT2 dimensions and emotions with matrix validation and state handling.",
  "frontend/src/components/PurchaseIntentionChart.tsx": "Displays a pie chart of purchase intention distribution across high, medium, and low levels.",
  "frontend/src/components/RecentAnalysis.tsx": "Lists the five most recent analyzed documents with mock emotion analysis labels and confidence scores.",
  "frontend/src/components/TemporalEvolutionChart.tsx": "Renders a time-grouped line chart of primary emotions from documents using mock analysis and Recharts.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and updates a backend actor based on Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for authentication, identity loading, and login state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching documents and uploading data, including cleaning logs and confusion matrix generation.",
  "frontend/src/index.css": "Configures global Tailwind CSS variables, themes, and print styles for consistent UI and report rendering.",
  "frontend/src/lib/datasetIngestion.ts": "Provides CSV/JSON dataset parsing utilities, normalizing headers and validating rows with required text fields.",
  "frontend/src/lib/icReplicaErrors.ts": "Provides utilities to extract IC replica rejection details, detect canister-stopped errors, and map upload failures to user-friendly messages.",
  "frontend/src/lib/marketingMetrics.ts": "Computes normalized marketing funnel metric scores from document text and aggregates them across documents.",
  "frontend/src/lib/marketingMixMetrics.ts": "Calculates normalized scores for the 8P Marketing Mix factors by scanning document text for relevant keywords.",
  "frontend/src/lib/mockData.ts": "Contains mock brand detection and simulated emotion analysis used for testing and placeholder analytics.",
  "frontend/src/lib/psychoSocialMetrics.ts": "Classifies emotions and computes UTAUT2 psycho-social scores from document text for heatmap analysis.",
  "frontend/src/lib/reportPdfExport.ts": "Triggers browser print-to-PDF export for the strategic report and checks availability of export content.",
  "frontend/src/lib/strategicReport.ts": "Generates strategic reports by analyzing emotions, brand mentions, psycho-social metrics, and marketing metrics from documents.",
  "frontend/src/lib/strategicReportLocale.ts": "Provides EN/ID UI label sets and helpers for retrieving localized labels and priority mappings.",
  "frontend/src/lib/visualizationState.ts": "Defines visualization state logic and utilities for sanitizing numbers, accessing arrays safely, and normalizing emotion labels.",
  "frontend/src/main.tsx": "Initializes the React app with query client and Internet Identity provider, then renders App.",
  "frontend/src/pages/AnalysisPage.tsx": "Renders the emotion analysis interface with filters, charts, and document management features.",
  "frontend/src/pages/Dashboard.tsx": "Handles text and file uploads for emotion analysis and displays dataset overview and charts.",
  "frontend/src/pages/MetricsPage.tsx": "Displays model and ensemble performance metrics with confusion matrices and reset capabilities.",
  "frontend/src/pages/PurchaseIntentionPage.tsx": "Renders a purchase‑intention dashboard, computes intention statistics, and displays charts and demographic components using fetched data.",
  "frontend/src/pages/SettingsPage.tsx": "Implements settings UI for model selection, ensemble configuration, thresholds, and toggles with save handling.",
  "frontend/src/pages/StrategicRecommendationReportPage.tsx": "Generates and displays a strategic recommendation report from documents with locale switching and export options (Markdown, print, PDF).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Tracks project state, goals, architecture notes, known issues, and existing feature definitions for dashboard and report development."
}