{
  "kind": "build_request",
  "title": "Apply a full-width blue gradient background to the main navigation header",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-40",
      "text": "Update the main navigation header background to use a full-width blue gradient (not a solid color) across the entire header bar, replacing the current semi-transparent `bg-background/95` styling while keeping the header sticky, blurred, and bordered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "biru pada background seluruh header, gradient",
          "berikan warna biru pada background seluruh header, gradient",
          "kerjakan sekarang"
        ]
      },
      "acceptanceCriteria": [
        "The `<header>` in `frontend/src/components/Header.tsx` uses Tailwind gradient classes (e.g., `bg-gradient-to-r` or similar) with blue tones and no longer uses `bg-background/95` or `supports-[backdrop-filter]:bg-background/60` as the primary background.",
        "The gradient is visible in both light and dark mode and remains full-width across the viewport.",
        "Header remains `sticky top-0` with the existing z-index behavior and still renders correctly on desktop and mobile."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Adjust header foreground styling to ensure readable contrast on the new blue gradient background, including nav buttons (active/hover states), theme toggle button, and brand/title area, without modifying any immutable UI component sources.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "berikan warna biru pada background seluruh header, gradient"
        ]
      },
      "acceptanceCriteria": [
        "Navigation labels and icons remain clearly legible against the gradient in both themes (no low-contrast text).",
        "Hover and active states remain visually distinct on the gradient background for both desktop nav buttons and the mobile sheet trigger.",
        "No files under `frontend/src/components/ui` and no immutable hook entrypoints are edited."
      ]
    }
  ],
  "constraints": [
    "Frontend changes must be limited to non-immutable paths (do not edit any files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT).",
    "Keep existing navigation items, routes, and icons unchanged; only update styling/appearance of the header background and related contrast styles."
  ],
  "nonGoals": [
    "Do not add new navigation items or change route paths.",
    "Do not introduce new authentication or theming systems.",
    "Do not redesign other pages or global theme tokens beyond what is necessary to support the header gradient readability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}