{
  "kind": "build_request",
  "title": "Add English/Indonesian language toggle to Strategic Recommendation Report",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Add a language toggle (English / Indonesian) on the Strategic Recommendation Report page that lets the user switch the entire report UI and report content between English and Bahasa Indonesia.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-19"
        ],
        "quotes": [
          "pada Strategic Recommendation Report, buatkan dalam 2 bahasa yaitu: Bahasa Inggris dan Bahasa Indonesia, ada tombol pilihannya"
        ]
      },
      "acceptanceCriteria": [
        "StrategicRecommendationReportPage shows an explicit language selection control with two options: English and Bahasa Indonesia.",
        "Switching the language updates all visible section headings, descriptions, buttons, badges, notices, and empty-state text on the page.",
        "The selection updates the displayed report content (executive summary, key findings, recommendation titles/rationales, risks, next steps) to the chosen language without requiring a page refresh.",
        "Language toggle does not break existing Print and Copy-as-Markdown functionality."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Update strategic report generation and markdown export utilities to support bilingual output (English and Bahasa Indonesia) via an explicit language/locale parameter, while keeping report generation deterministic for a given dataset and selected language.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-19"
        ],
        "quotes": [
          "buatkan dalam 2 bahasa yaitu: Bahasa Inggris dan Bahasa Indonesia"
        ]
      },
      "acceptanceCriteria": [
        "generateStrategicReport accepts a language/locale argument (e.g., 'en' | 'id') and returns a report whose narrative fields are in the requested language.",
        "reportToMarkdown accepts the same language/locale (or uses the report’s language) and outputs fully localized Markdown headers/labels and content in the selected language.",
        "Priority labels (HIGH/MEDIUM/LOW) are localized appropriately in the UI and in the Markdown export for Indonesian.",
        "For the same documents + same selected language, the generated content remains deterministic (no randomness/time-dependent wording beyond the existing generatedAt timestamp)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Ensure the language toggle works consistently across all Strategic Recommendation Report states (loading, empty dataset, dataset present) and that date formatting uses an appropriate locale for the selected language.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-19"
        ]
      },
      "acceptanceCriteria": [
        "When loading, the page shows the existing loading UI; language selection (if visible) does not cause runtime errors.",
        "When documents.length === 0, the empty state text and CTA are localized based on the selected language.",
        "When documents are present, the 'Generated on' timestamp formatting uses a locale consistent with the selected language (e.g., en-US for English, id-ID for Indonesian)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (immutable UI component sources).",
    "Do not modify immutable hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend architecture unchanged (single Motoko actor); this change should be implemented entirely on the frontend/report generation utilities unless strictly necessary."
  ],
  "nonGoals": [
    "Adding additional languages beyond English and Bahasa Indonesia.",
    "Implementing a global app-wide i18n system across all pages (scope is Strategic Recommendation Report only).",
    "Changing the underlying analysis logic or metrics computation beyond what is needed to provide translated narrative output."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}