{
  "kind": "build_request",
  "title": "Improve dataset upload handling for IC0508 canister-stopped replica rejection",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When uploads fail due to an Internet Computer replica rejection indicating the target canister is stopped (error_code IC0508 / reject_code 5, e.g. \"Canister hhqxf-xiaaa-aaaam-afemq-cai is stopped\"), show a clear English user-facing error that explains the backend is unavailable and the user cannot fix it from the UI (try again later / contact administrator), while still surfacing technical details for debugging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Reject text: Canister hhqxf-xiaaa-aaaam-afemq-cai is stopped\n  Error code: IC0508\n...\nMethod name: batchUploadDocuments"
        ]
      },
      "acceptanceCriteria": [
        "Triggering an upload while the backend canister is stopped results in a user-facing message in English that explicitly states the backend canister is stopped/unavailable and uploads cannot proceed until it is started/redeployed.",
        "The UI continues to display technical details (at minimum the reject_message and error_code/reject_code when available) so operators can debug using the provided information."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Preserve original replica rejection details when propagating errors from upload mutations so that the error mapping logic can reliably detect IC0508 (canister stopped) and render the correct message, rather than replacing the error with a new generic Error that loses reject_code/error_code metadata.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Method name: batchUploadDocuments\n...\nerror_code\": \"IC0508\""
        ]
      },
      "acceptanceCriteria": [
        "If addCleaningLog fails due to canister stopped, the thrown error still contains the original rejection details (or an equivalent structured error) such that the existing canister-stopped detection logic can identify IC0508/reject_code 5.",
        "Uploading a dataset (CSV/JSON batch) and uploading a single document both produce consistent canister-stopped messaging when the canister is stopped."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update upload error detail formatting to include the most relevant replica rejection fields when present (error_code, reject_code, reject_message, and any available request/canister identifiers) in a readable English multi-line block for the DatasetUploadStatus error panel and console logs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Request ID: d79066b314f23efbab52935936d91d32b21a1e23e470081f87e01ccb5ee25574\nReject code: 5\nReject text: Canister hhqxf-xiaaa-aaaam-afemq-cai is stopped\nError code: IC0508"
        ]
      },
      "acceptanceCriteria": [
        "When an upload fails, DatasetUploadStatus shows an error block that includes (when available) IC error_code, reject_code, and reject_message on separate lines for readability.",
        "Console logs for upload failures include the same technical fields (when available) without dropping the original error information."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text added or modified as part of this fix.",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Starting/stopping/redeploying the canister from the application UI (this is an operational/deployment action, not an app feature).",
    "Changing the backend Motoko canister logic or storage schema to address operational canister stop state."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}