{
  "kind": "build_request",
  "title": "Add Marketing Mix Radar Chart (8 factors) visualization to Dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Create deterministic frontend-only computation utilities for a Marketing Mix radar chart with exactly 8 factors: (1) PROD — Product / Innovative Product Strategy, (2) PRICE — Price / Innovative Pricing Architecture, (3) DIST — Place / Innovative Distribution Network, (4) COMM — Promotion / Innovative Communication Strategy, (5) HRD — People / Innovative Human Resource Development, (6) CUSJ — Process / Innovative Customer Journey Design, (7) BRAND — Physical Evidence / Innovative Brand Experience Creation, (8) COLLAB — Collaboration Ecosystem Strategy (Proposed). The utilities must aggregate scores across the currently uploaded documents and output normalized 0–100 values per factor (stable/deterministic for the same inputs).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "buatkan tambahan visualisasi radar chart Marketing Mix dengan faktor berikut: 1.Product Innovative Product Strategy - PROD\n2.Price Innovative Pricing Architecture-PRICE\n3.Place Innovative Distribution Network-DIST\n4.Promotion (Innovative Communication Strategy-COMM)\n5. People (Innovative Human Resource Development-HRD)\n6. Process (Innovative Customer Journey Design-CUSJ)\n7. Physical Evidence (Innovative Brand Experience Creation-BRAND)\n8.Collaboration Ecosystem Strategy (Usulan)"
        ]
      },
      "acceptanceCriteria": [
        "A new reusable computation module exists under frontend/src/lib (or an extension of an existing lib module) that returns an ordered list/array of 8 factor scores for a given Document[] input.",
        "Returned factor list order is exactly: PROD, PRICE, DIST, COMM, HRD, CUSJ, BRAND, COLLAB.",
        "Each factor score is a finite number clamped to the inclusive range 0–100 (no NaN/Infinity).",
        "For identical document contents, the computed factor scores are deterministic (no randomness, no time-based effects)."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add a new React component `MarketingMixRadarChart` that renders the Marketing Mix radar chart using the 8 computed factors and follows the existing visualization state conventions (loading/empty/insufficient/ready) used by other charts (e.g., `getVisualizationState`, numeric sanitization/clamping). All user-facing text in this new component must be in English (title, description, empty/insufficient messages, labels/tooltips).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "buatkan tambahan visualisasi radar chart Marketing Mix ..."
        ]
      },
      "acceptanceCriteria": [
        "A new file exists at frontend/src/components/MarketingMixRadarChart.tsx (or equivalent in the same components directory) exporting the chart component.",
        "When `hasActiveDataset` is false or `documents.length === 0`, the component shows an empty/idle state (no radar rendered) with English messaging.",
        "When a dataset exists but derived factor scores are all zero/uncomputable, the component shows an 'insufficient data' state with English messaging (no crash).",
        "When valid factor data exists, the component renders a radar chart with 8 axes and values scaled 0–100.",
        "The chart tooltip (or an adjacent legend/help section) exposes both the factor code and its full English factor name so users can interpret PROD/PRICE/DIST/COMM/HRD/CUSJ/BRAND/COLLAB.",
        "The component does not modify any immutable UI component source paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Integrate the new `MarketingMixRadarChart` into the main Dashboard page (`frontend/src/pages/Dashboard.tsx`) alongside the existing visualizations, passing the currently loaded `documents` and `hasActiveDataset` so it updates immediately when documents are uploaded/deleted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard imports and renders `MarketingMixRadarChart` using the same document source as other charts (`useGetAllDocuments`).",
        "The new chart appears as a distinct Dashboard section/card and uses consistent spacing/layout with existing Dashboard chart sections.",
        "The chart re-renders/refetches correctly when document count changes (e.g., by using a `key` pattern consistent with other Dashboard charts or equivalent reactive wiring).",
        "No backend changes are required for the new visualization to display."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Respect existing visualization state handling patterns (no runtime errors on empty/insufficient datasets).",
    "Backend must remain single-actor; do not introduce additional backend services or external databases."
  ],
  "nonGoals": [
    "Do not change the existing Marketing Effectiveness radar chart behavior (`MarketingRadarChart`) except where necessary to avoid shared-type conflicts.",
    "Do not add third-party auth providers or external analytics services.",
    "Do not require new backend endpoints for Marketing Mix scoring; compute from existing `documents` on the frontend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}