{
  "kind": "build_request",
  "title": "Fix dataset upload failures by handling stopped-canister (IC0508) errors and improving upload resilience",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Make the dataset upload flow resilient to backend failures by preventing a failed `addCleaningLog` call from crashing the entire upload operation, and by surfacing a clear, actionable error when the backend canister is stopped (IC0508). Update both single upload (`useUploadDocument`) and batch upload (`useUploadDocumentsBatch`) to (a) wrap `actor.addCleaningLog(...)` in try/catch, (b) if logging fails, continue with `uploadDocument` when possible, and (c) if the failure is an IC replica/canister-stopped rejection (e.g., reject_message includes \"is stopped\" / error_code IC0508), throw an Error with an English message that explicitly states the backend canister is stopped and the upload cannot proceed until it is started/redeployed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The replica returned a rejection error... Reject text: Canister 33tw5-ziaaa-aaaai-q5roq-cai is stopped ... Method name: addCleaningLog ... terjadi eror dalam upload data, tolong perbaiki"
        ]
      },
      "acceptanceCriteria": [
        "Uploading a .txt file does not fail solely because `addCleaningLog` fails; the document upload still proceeds when the backend is otherwise available.",
        "Uploading a .csv/.json dataset does not fail solely because `addCleaningLog` fails; batch upload still proceeds when the backend is otherwise available.",
        "When the backend canister is stopped (IC0508 / reject_message contains \"is stopped\"), the upload mutation rejects with a clear English error message indicating the canister is stopped and must be started/redeployed before uploads can work.",
        "No unhandled promise rejections occur during upload when `addCleaningLog` fails."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Update the Dashboard upload UI to display backend replica rejection details in a user-friendly, English error state. When an upload fails, ensure `DatasetUploadStatus` (error state) and the toast error message show an English summary and include the underlying error message (e.g., reject_message) so the issue is debuggable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The replica returned a rejection error... reject_message: \"Canister 33tw5-ziaaa-aaaai-q5roq-cai is stopped\""
        ]
      },
      "acceptanceCriteria": [
        "If an upload fails due to IC0508/canister stopped, the Dashboard shows an error status card and a toast with English text; the displayed error includes the underlying reject message (or a mapped English explanation) so it is actionable.",
        "If an upload fails for a non-IC0508 reason, the UI still shows a clear English error message and preserves the original error message for debugging.",
        "The upload status card does not remain stuck in \"uploading\" after any failure; it transitions to the \"error\" state reliably."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Ensure all newly introduced user-facing strings related to the canister-stopped/upload-failure handling are in English (including mapped error titles, descriptions, and call-to-action guidance).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "All new strings added as part of the upload error handling (including IC0508 mapping) are English.",
        "No Indonesian text is introduced for any new error-handling UI added in this change."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` or any other paths listed in `frontend.immutablePaths`.",
    "Backend remains a single Motoko actor in `backend/main.mo`; do not add additional backend services."
  ],
  "nonGoals": [
    "Starting/redeploying/stopping the canister from within the application (operational action outside app scope).",
    "Changing the dataset parsing/validation rules beyond what is required to improve error handling for backend upload failures."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}