{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reliable visualization rendering and consistent dataset state handling",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Fix dashboard visualizations so they always render when documents exist and never show incorrect empty-state due to stale/incorrect dataset detection.",
      "acceptanceCriteria": [
        "After uploading a document from the Dashboard, each visualization on the Dashboard (EmotionDistributionChart, BrandEmotionChart, GenderEmotionChart, GeoEmotionMap, PsychoSocialHeatmap, MarketingRadarChart) displays a non-empty visualization state (or a clear 'insufficient data' message if the uploaded content truly cannot produce that metric), and does not incorrectly show 'No active data' / equivalent empty-state messaging.",
        "No visualization remains blank due to missing props, incorrect hasActiveDataset logic, or stale query/cache state after upload.",
        "No runtime errors occur when rendering these visualizations with valid non-empty documents."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BrandEmotionChart.tsx",
          "operation": "modify",
          "description": "Fix brand/emotion aggregation so emotion keys are consistent (avoid mixing Indonesian labels with English emotion ids from analysis), and ensure the chart renders a valid non-empty state whenever at least one document contains a detectable brand; otherwise show an 'insufficient data' message distinct from 'no dataset'."
        },
        {
          "path": "frontend/src/components/GenderEmotionChart.tsx",
          "operation": "modify",
          "description": "Adjust empty-state logic to distinguish: (a) no documents uploaded vs (b) documents exist but gender distribution is unavailable/empty; ensure Recharts receives only valid numeric values and never renders blank due to undefined payloads."
        },
        {
          "path": "frontend/src/components/GeoEmotionMap.tsx",
          "operation": "modify",
          "description": "Harden data guards for geo distribution matrices (row/column existence, numeric coercion) and ensure the UI differentiates 'no dataset' from 'dataset present but no valid Indonesian location signals' without getting stuck after upload/delete."
        },
        {
          "path": "frontend/src/components/EmotionDistributionChart.tsx",
          "operation": "modify",
          "description": "Align dataset detection and derived-metric computation guards so the component never shows an incorrect empty-state when documents exist; ensure chart data never includes undefined/NaN values that can cause Recharts to render blank."
        },
        {
          "path": "frontend/src/components/PsychoSocialHeatmap.tsx",
          "operation": "modify",
          "description": "Ensure heatmap matrix computation and rendering are fully guarded (dimensions, bounds checks) and that the component shows a clear 'insufficient data to compute psycho-social metrics' message when documents exist but computation yields no matrix."
        },
        {
          "path": "frontend/src/components/MarketingRadarChart.tsx",
          "operation": "modify",
          "description": "Ensure derived marketing metrics are computed defensively from documents, clamp/coerce invalid values, and render either a stable radar visualization or a clear 'insufficient data' message (not the 'no dataset' empty-state) when documents exist."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Ensure the Dashboard passes a single source-of-truth dataset state derived from the documents query to visualization components that support it, and that visualizations are keyed/refreshed appropriately after upload so they don't remain in a stale empty-state."
        },
        {
          "path": "frontend/src/pages/AnalysisPage.tsx",
          "operation": "modify",
          "description": "Ensure visualization props and dataset state are consistent between filteredDocuments vs full documents (to avoid charts incorrectly showing 'no dataset' when filters yield 0 but dataset exists); update visualization wiring to show correct messaging."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Standardize dataset availability and data-shape validation across visualization components for loading, empty dataset, insufficient derived metric, and valid states without runtime errors.",
      "acceptanceCriteria": [
        "Each visualization component has deterministic guards for undefined/null/empty inputs and does not index into arrays/objects without checking bounds/availability first (e.g., heatmap matrix row/col access).",
        "For derived computations (e.g., marketing metrics, psycho-social matrix), components render a stable UI when the computed result is empty even though documents exist, using a distinct message from the 'no dataset uploaded' empty state.",
        "Console shows no React rendering errors or warnings caused by invalid Recharts inputs (e.g., undefined values, NaN, missing keys) after uploading documents."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/visualizationState.ts",
          "operation": "create",
          "description": "Create a small shared utility to standardize dataset/metric state resolution (e.g., loading vs no dataset vs insufficient derived metric vs ready) and provide safe numeric coercion/clamping helpers for chart inputs."
        },
        {
          "path": "frontend/src/components/EmotionDistributionChart.tsx",
          "operation": "modify",
          "description": "Adopt the shared visualization state utility for deterministic guards and chart-data sanitization; ensure no unsafe indexing and no Recharts-invalid values. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BrandEmotionChart.tsx",
          "operation": "modify",
          "description": "Adopt the shared visualization state utility for consistent 'no dataset' vs 'insufficient metric' messaging and ensure data-shape normalization before passing data to Recharts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/GenderEmotionChart.tsx",
          "operation": "modify",
          "description": "Adopt the shared visualization state utility and sanitize/normalize distribution values (ensure finite numbers); prevent tooltip rendering from assuming payload shape. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/GeoEmotionMap.tsx",
          "operation": "modify",
          "description": "Adopt the shared visualization state utility and apply strict bounds checks when reading the geo matrix; coerce missing cells to 0 and keep the UI stable when derived display data is empty. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PsychoSocialHeatmap.tsx",
          "operation": "modify",
          "description": "Adopt the shared visualization state utility; add matrix dimension validation and safe access helpers so the heatmap never indexes out of bounds, and renders an 'insufficient data' state when computation yields an empty matrix. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/MarketingRadarChart.tsx",
          "operation": "modify",
          "description": "Adopt the shared visualization state utility; ensure radar inputs are finite numbers with required keys present to avoid Recharts warnings and blank renders. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Ensure React Query invalidation/refetch produces immediate and consistent visualization updates across all pages after document upload/delete.",
      "acceptanceCriteria": [
        "Uploading a document triggers the relevant queries/derived-data views to update without requiring a manual refresh (including gender/geo/purchase intention queries and any charts that depend on documents).",
        "Deleting documents down to an empty dataset transitions all affected visualizations back to their empty states without crashes or stale rendered data.",
        "Navigating to the Strategic Recommendation Report after uploading documents generates and renders the report content without requiring additional user actions or page reloads."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Standardize query behaviors for all document-dependent queries to avoid stale/incorrect dataset detection: ensure documents query and derived queries refetch promptly after mutations (e.g., set refetchOnMount/refetchOnWindowFocus as appropriate, reduce staleTime, and prevent enabled-gating from keeping queries stuck when documents transition from 0→1 or 1→0)."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "After successful upload, ensure UI reflects the latest documents state immediately (avoid relying on stale memo/derived flags); if needed, trigger navigation only after the documents query is up-to-date so downstream pages/charts render reliably."
        },
        {
          "path": "frontend/src/pages/AnalysisPage.tsx",
          "operation": "modify",
          "description": "Ensure delete/upload transitions propagate cleanly through all visualizations on the page (including tabbed content) without requiring refresh; avoid deriving 'has dataset' from filtered results."
        },
        {
          "path": "frontend/src/pages/PurchaseIntentionPage.tsx",
          "operation": "modify",
          "description": "Ensure purchase intention visualizations update immediately after upload/delete by basing dataset availability on the documents query and ensuring dependent components re-render when documents length changes."
        },
        {
          "path": "frontend/src/pages/StrategicRecommendationReportPage.tsx",
          "operation": "modify",
          "description": "Ensure the report regenerates deterministically from the latest documents after upload/delete and that the page doesn't remain in an empty state due to stale documents data when navigated to right after an upload."
        },
        {
          "path": "frontend/src/pages/MetricsPage.tsx",
          "operation": "modify",
          "description": "Ensure confusion matrix and performance views consistently transition between dataset empty/active states without stale renders by keying visualizations off documentCount and relying on immediate query refetch behavior."
        }
      ]
    }
  ]
}