{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Bilingual (EN/ID) toggle for Strategic Recommendation Report",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Add an English/Bahasa Indonesia toggle on the Strategic Recommendation Report page and localize all visible UI text and report content without refresh.",
      "acceptanceCriteria": [
        "StrategicRecommendationReportPage shows an explicit language selection control with two options: English and Bahasa Indonesia.",
        "Switching the language updates all visible section headings, descriptions, buttons, badges, notices, and empty-state text on the page.",
        "The selection updates the displayed report content (executive summary, key findings, recommendation titles/rationales, risks, next steps) to the chosen language without requiring a page refresh.",
        "Language toggle does not break existing Print and Copy-as-Markdown functionality."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StrategicRecommendationReportPage.tsx",
          "operation": "modify",
          "description": "Add locale state ('en'|'id') and a visible language selection control (use shadcn-ui Button/Badge styling patterns for a segmented toggle; Verify the component's usage instructions before implementing). Pass the selected locale into report generation and markdown export utilities, and replace all hardcoded strings on this page (titles, section headers, descriptions, buttons, badges, notices) with locale-aware labels. Ensure Print and Copy-as-Markdown handlers continue to work with the localized content."
        },
        {
          "path": "frontend/src/lib/strategicReportLocale.ts",
          "operation": "create",
          "description": "Create a report-scoped localization helper (no global i18n) that centralizes EN/ID UI labels used by StrategicRecommendationReportPage (e.g., headings, button text, empty-state, notices, and priority labels). Keep it limited to the Strategic Report feature area and structured for deterministic string selection."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Update strategic report generation and markdown export utilities to accept an explicit locale parameter and produce deterministic bilingual output including localized priority labels.",
      "acceptanceCriteria": [
        "generateStrategicReport accepts a language/locale argument (e.g., 'en' | 'id') and returns a report whose narrative fields are in the requested language.",
        "reportToMarkdown accepts the same language/locale (or uses the report’s language) and outputs fully localized Markdown headers/labels and content in the selected language.",
        "Priority labels (HIGH/MEDIUM/LOW) are localized appropriately in the UI and in the Markdown export for Indonesian.",
        "For the same documents + same selected language, the generated content remains deterministic (no randomness/time-dependent wording beyond the existing generatedAt timestamp)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/strategicReport.ts",
          "operation": "modify",
          "description": "Introduce a Locale type ('en'|'id') and update generateStrategicReport to accept a locale parameter and generate all narrative fields (executiveSummary, keyFindings, recommendation titles/rationales, risks, nextSteps) in the requested language using deterministic template/translation maps. Update reportToMarkdown to accept locale (or derive from report) and localize all Markdown section headers/labels/content, including localized priority labels for Indonesian."
        },
        {
          "path": "frontend/src/lib/strategicReportLocale.ts",
          "operation": "modify",
          "description": "Add deterministic translation maps/templates needed by strategic report generation and markdown export (e.g., section titles, boilerplate sentences, priority label mappings HIGH/MEDIUM/LOW => Indonesian equivalents) and export helpers consumed by strategicReport.ts and the report page."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Ensure the language toggle behaves consistently across loading/empty/data states and formats generated timestamps using the selected locale.",
      "acceptanceCriteria": [
        "When loading, the page shows the existing loading UI; language selection (if visible) does not cause runtime errors.",
        "When documents.length === 0, the empty state text and CTA are localized based on the selected language.",
        "When documents are present, the 'Generated on' timestamp formatting uses a locale consistent with the selected language (e.g., en-US for English, id-ID for Indonesian)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/StrategicRecommendationReportPage.tsx",
          "operation": "modify",
          "description": "Ensure locale state is initialized safely and can be interacted with (or at least rendered) without breaking the existing loading spinner state. Localize the empty-state content and CTA based on locale, and update the on-page generated timestamp formatting to use the appropriate locale (en-US vs id-ID) while keeping the current dateStyle/timeStyle behavior."
        },
        {
          "path": "frontend/src/lib/strategicReport.ts",
          "operation": "modify",
          "description": "Update markdown timestamp formatting to use the requested locale (en-US vs id-ID) and ensure any locale-based labels used during export remain consistent with the page selection."
        }
      ]
    }
  ]
}