{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Marketing Mix (8-factor) Radar Chart on Dashboard",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Add deterministic frontend-only utilities to compute 8 Marketing Mix factor scores (0–100) aggregated across uploaded documents in a fixed order.",
      "acceptanceCriteria": [
        "A new reusable computation module exists under frontend/src/lib (or an extension of an existing lib module) that returns an ordered list/array of 8 factor scores for a given Document[] input.",
        "Returned factor list order is exactly: PROD, PRICE, DIST, COMM, HRD, CUSJ, BRAND, COLLAB.",
        "Each factor score is a finite number clamped to the inclusive range 0–100 (no NaN/Infinity).",
        "For identical document contents, the computed factor scores are deterministic (no randomness, no time-based effects)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/marketingMixMetrics.ts",
          "operation": "create",
          "description": "Create deterministic Marketing Mix scoring utilities: define the 8-factor constant set (codes + full English names) and export a function that aggregates scores across Document[] and returns factor scores in the exact required order (PROD, PRICE, DIST, COMM, HRD, CUSJ, BRAND, COLLAB), with numeric sanitization and clamping to 0–100."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Implement MarketingMixRadarChart React component with consistent visualization state handling and English-only UI text.",
      "acceptanceCriteria": [
        "A new file exists at frontend/src/components/MarketingMixRadarChart.tsx (or equivalent in the same components directory) exporting the chart component.",
        "When `hasActiveDataset` is false or `documents.length === 0`, the component shows an empty/idle state (no radar rendered) with English messaging.",
        "When a dataset exists but derived factor scores are all zero/uncomputable, the component shows an 'insufficient data' state with English messaging (no crash).",
        "When valid factor data exists, the component renders a radar chart with 8 axes and values scaled 0–100.",
        "The chart tooltip (or an adjacent legend/help section) exposes both the factor code and its full English factor name so users can interpret PROD/PRICE/DIST/COMM/HRD/CUSJ/BRAND/COLLAB.",
        "The component does not modify any immutable UI component source paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MarketingMixRadarChart.tsx",
          "operation": "create",
          "description": "Add MarketingMixRadarChart component that consumes {documents, hasActiveDataset} and renders a Recharts radar chart (0–100) driven by the Marketing Mix computation utilities; use existing visualization conventions (getVisualizationState, toFiniteNumber/clamp patterns) for loading/empty/insufficient/ready; ensure all user-facing strings (title/description/messages/labels/tooltips/legend) are English and include both factor code and full English factor name for interpretation."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Wire MarketingMixRadarChart into Dashboard alongside existing visualizations using current documents and dataset state.",
      "acceptanceCriteria": [
        "Dashboard imports and renders `MarketingMixRadarChart` using the same document source as other charts (`useGetAllDocuments`).",
        "The new chart appears as a distinct Dashboard section/card and uses consistent spacing/layout with existing Dashboard chart sections.",
        "The chart re-renders/refetches correctly when document count changes (e.g., by using a `key` pattern consistent with other Dashboard charts or equivalent reactive wiring).",
        "No backend changes are required for the new visualization to display."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Import and render MarketingMixRadarChart within the existing Dashboard charts section, passing the current documents and hasActiveDataset derived from useGetAllDocuments; add a documents-length-based key consistent with other chart sections so it updates immediately when documents are uploaded/deleted, while preserving existing layout/spacing conventions."
        }
      ]
    }
  ]
}