{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Resilient dataset uploads with IC0508 (canister stopped) error handling and debuggable UI errors",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Make single and batch dataset uploads resilient by isolating addCleaningLog failures and mapping canister-stopped (IC0508) rejections to a clear, actionable error.",
      "acceptanceCriteria": [
        "Uploading a .txt file does not fail solely because `addCleaningLog` fails; the document upload still proceeds when the backend is otherwise available.",
        "Uploading a .csv/.json dataset does not fail solely because `addCleaningLog` fails; batch upload still proceeds when the backend is otherwise available.",
        "When the backend canister is stopped (IC0508 / reject_message contains \"is stopped\"), the upload mutation rejects with a clear English error message indicating the canister is stopped and must be started/redeployed before uploads can work.",
        "No unhandled promise rejections occur during upload when `addCleaningLog` fails."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/icReplicaErrors.ts",
          "operation": "create",
          "description": "Add shared helpers to (1) extract replica rejection details from unknown errors, (2) detect canister-stopped failures (e.g., error_code IC0508 and/or reject_message including \"is stopped\"), and (3) produce an English, actionable error message for canister-stopped upload failures."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update `useUploadDocument` and `useUploadDocumentsBatch` to wrap `actor.addCleaningLog(...)` in try/catch; if logging fails and is NOT canister-stopped, continue with `uploadDocument` when possible; if it IS canister-stopped (IC0508 / message contains \"is stopped\"), throw an Error with an explicit English message stating the backend canister is stopped and uploads cannot proceed until it is started/redeployed. Ensure all promises are awaited/handled to avoid unhandled rejections."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Update the Dashboard upload UI to show English, user-friendly error states that include underlying replica rejection details for debugging.",
      "acceptanceCriteria": [
        "If an upload fails due to IC0508/canister stopped, the Dashboard shows an error status card and a toast with English text; the displayed error includes the underlying reject message (or a mapped English explanation) so it is actionable.",
        "If an upload fails for a non-IC0508 reason, the UI still shows a clear English error message and preserves the original error message for debugging.",
        "The upload status card does not remain stuck in \"uploading\" after any failure; it transitions to the \"error\" state reliably."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Use the shared replica error helpers to build an English toast error summary and include underlying error details (e.g., reject message) on failures for both single (.txt) and batch (.csv/.json) uploads; ensure the `DatasetUploadStatus` error state receives the debuggable error detail string so the status card reliably transitions to 'error' and is not stuck in 'uploading'."
        },
        {
          "path": "frontend/src/components/DatasetUploadStatus.tsx",
          "operation": "modify",
          "description": "Adjust the error-state copy to be English and explicitly present a clear summary plus the provided underlying error detail (when available), so replica rejection messages (e.g., canister stopped) are visible and actionable."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Ensure all newly introduced canister-stopped/upload-failure strings are English (titles, descriptions, and call-to-action guidance).",
      "acceptanceCriteria": [
        "All new strings added as part of the upload error handling (including IC0508 mapping) are English.",
        "No Indonesian text is introduced for any new error-handling UI added in this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/icReplicaErrors.ts",
          "operation": "modify",
          "description": "Ensure all user-facing strings produced by the new error mapping helpers (including IC0508/canister-stopped guidance) are written in English."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Ensure any newly added toast/status messaging related to upload failures and canister-stopped handling is English-only while preserving underlying technical error text for debugging."
        },
        {
          "path": "frontend/src/components/DatasetUploadStatus.tsx",
          "operation": "modify",
          "description": "Ensure any newly added/updated error-state labels and descriptions introduced for improved upload failure handling are English-only."
        }
      ]
    }
  ]
}